{
    "title": "BITCOIN Price Prediction $61,248 | BTC Analysis Today BK Crypto",
    "description": "Bitcoin Price Analysis Today: In today's bitcoin price prediction video, we look at the global conflict in the middle east and the ...",
    "view_count": "25",
    "like_count": "3",
    "subscriber_count": "26900",
    "caption": "My people, my people. Its about that time. Live from USA, helping you get paid every day. This is the Boss of Bitcoin, the Cristo of Crypto. It's your boy BK. And if you don't like me, you must not like money. Thank you for joining me, everybody. Today we are doing an episode called war and bitcoin. We do indeed live in very interesting times. So we're going to be looking at the financial impact of global conflict and how that can impact the financial markets as well. Most notably that which is blockchain technology, trying to assist you and facilitate the greatest transformational wealth in the history of humanity. So if this is your first time tuning in, congratulations baby. You are now rocking with the best. My name is BK, also known as a crypto trader and I'm the boast of these charts as you will soon find out. Every day I grace this microphone with my voice is another day you can profit as a result. And today is no exception. So if you haven't done it, subscribe like the video, turn the notifications on all of the above because we give away free bitcoin every single Friday. All you need to do is leave a comment on any video I do and every Friday a new winner will be selected. Every video I do is a chance to win. So just leave a comment. The easiest thing to do, shout out your city. Let me know where in the world you tuning in from. And a new winner will be selected tomorrow. So good luck to you. So ain't nothing to it but to do it. Let's jump into it. This is an article from today or yesterday. Bitcoin tumbles back towards 60,000 as tensions in the Middle east rise. Cryptocurrencies were under pressure Wednesday as it slid back to kick off what is usually one of its strongest months. That is true. Flagship crypto was off. Crypto exchange hovered flat. Yes, here we go. Rising tensions in the Middle east dampened investor risk appetite as the new trading month and quarter begin on Tuesday, Iran launched a weapon on these guys in retaliation for its recent unaliving of this person. Right, so surging unrest across the Middle east has propelled oil prices upwards and reinforce the dollar strength, casting a shadow over bitcoin and speculative investments. Right, because when your hands covered in blood money and oil, the only thing to buy is Wall street, apparently, said the chief operating officer and co founder of Bitcoin, Ira. So what's happening right now is there is indeed, you know, global conflict within middle eastern areas. But that's not really what I wanted to focus on what I wanted to talk about is what's happening behind the scenes, because I think all too often we just look at the COVID story and we're like, oh, my God, that's so horrible. But we don't know. Like, there are hundreds of billions of dollars circulating and being spent and received by companies participating and facilitating this orchestrated conflict. Gross domestic product. What is the definition of gross domestic product? I'm glad you asked. Monetary value of goods produced plus monetary values of services provided equals GDP. Essentially, it's all of the goods, all of the products, and all of the services that any given country produces in any given year. That's GDP, services, and goods combined, right? I say all that to say this is a very, very, very interesting chart. As recent as 2022, top 40 countries in military spending. How much did the United States spend for its military in 2022, 2021? Almost a trillion dollars. 876 billion. Keep in mind, the entire bitcoin market, I think, is right north of a trillion dollars. So essentially, the United States military could have bought all the bitcoin on record, you know, if they just wouldn't have produced one tank, you know, so we got almost a trillion for the United States. I think when you look at another chart, it's basically the United States and then the next ten countries combined, that's how much we spend on weapons of mass destruction. It's literally, you know, a hypocrisy of democracy to think that, you know, this war machine isn't set up to profit when missiles strike. I think this little chart right here, military spending as a share of GDP right there, you can see we're kind of in that pinkish area. So I think that correlates to about four or 5%. To put that in the simple terms as four or 5% of your working dollars are spent on, you know, drone strikes, missile strikes, whatever it might be somewhere else in the world on behalf of democracy, of course. So essentially, easily you could just say, say is 30 days in a month. You know, that's about a day and a half of your month. Every month is just, you know, going straight to funding the largest military entity the world has ever known. Known. It's almost, you know, laughable. But this is the reality that we live in. This is why, you know, some people, you know, that accumulate a lot of wealth, choose to be very clever with how they do their accounting so they don't pay taxes, because this is what your tax dollars are going to. 5% of GDP. That means one out of every $20 that the government spends is going to fund future destruction. I believe Dick Cheney said it best on stage. He talked about when the only tool you got in the box is a hammer. He said, every problem need to look like a nail. And we got the biggest hammer in the world, a trillion dollars worth. So every little nail is gonna get hit around the world. In fact, you know, Mister Cheney, people forget I, he was in real good with Halliburton. And back, back in the day, this was early. Two thousands Halliburton stock went up. Actually, I'm gonna show you. It's a thousand percent during the war in Iraq. And it's crazy. I'll let you if you want to, you know, pause the video and look for this. But it's a few publications that were rented. But essentially he worked for a Pentagon for a very long time and then took over the role of CEO at Halliburton. And right after he got done working at the Pentagon and got on with Halliburton is right around the time the United States government had to go and look for weapons of mass destruction and funnel tens of thousands of soldiers into Iraq. And this was like one of the first outsourced operations because they didn't have a lot of soldiers in Iraq. So it's not like you had to send millions and millions and millions and millions of foot soldiers over there. You almost outsourced it to these entities like Blackwater and other organizations. Ironically enough, Blackwater was, you know, seen the last guy that tried to unalive Trump. He was actually in one of those Blackwater employment videos back in the day. So go figure, huh? Small world. Crazy. But here we go. We now have a situation to where these companies are able to buy and leverage future politicians, right? So when you look at donations made for political campaigns, these companies are near the top of the list, right? It's crazy that we live in a world where votes are for sale to the highest bidder. And all too often, it's the companies that have the most profit to make on one side by selling $10,000 missiles. And the government is really just pimping itself out for future conflict, right? So here's Halliburton stock again. This is the years of the war in Iraq. And you can see Halliburton back in the day, you know, was $5 a share. And we got out of Iraq late 2011 when that happened. Let's see here. Let's get this one off. There you go. 700% over the course of that decade. So it's, you know, it's like causation, correlation. This is the working business model. Build these huge defense contract based companies, strategic asset, you know, supply chain logistic, public perception controllers, and profit from plunder. I think it's a video that Nicolas Cage was back in called God of War back in the day. And it was very interesting just to see, like, how much they don't even show. It wasn't. He got a war. Nicholas Cage. Yeah. There you go. Lord of war. Okay. Same thing. Same thing. But I talked about, you know, the manipulation and the behind the scenes efforts that they go through to ensure these conflicts happen because they don't care. You know what I'm saying? They got. They hammer, and then they'll go have to get hit. So, you know, political upheavals, coups, like the whole nine. It's. It's really like a spy versus spy game, you know, to funnel the next operation. I say all that to say that we now have a much more suitable, viable alternative. It's called blockchain technology. I talked about the ability for these companies to literally buy politicians and, you know, don't matter if you vote red, you vote blue, you know, monkey see, monkey do, and they all paid for and accountable and accounted for. So you, you know, blockchain technology, I believe, is a much more viable alternative when it comes to future governance for much more capable financial capability. As I mentioned, you know, spending the money that the United States military spent last year on funding itself, you could have bought. You could have bought the entire bitcoin market, like $1 trillion. Boom. Now you basically control the market. It gives you an idea of the smallest scale that bitcoin is currently operating at. And the endless scale that government spending is that I showed this chart before. It talks about what bitcoin needs to reach a million dollars per BTC right down there in state treasury. That's talking about government money. If we just get 1% of that, that gives us $3.8 trillion, which more than, you know, triples the current market cap of BTC. And I've talked about, you know, black swan events and different things that could contribute to the cascade of money coming into the market. And, you know, war is a profitable engine for economies like, we've been brainwashed and duped to hear on every mainstream media channel that war is good for the economy. Well, it is. You know, when you got the current vice president or the former vice president sitting on your staff and he lined up a few, a few decades worth of conflict in the Middle east to make sure you get them defense contracts and you, you the primary subcontractor of choice. Like, that's. That's the world we live in. This is, uh, the cacos socracy of capitalism. It's. It's amazing just to see and witness this, um, you know, debacle of society. But yet, and still, here we are. I think one of the other things that's most notable to take away in this conversation, I said it before in one of my shows, like, when you watch a football game, when you watch an NFL football game, you know, we're receiving this entertainment at a cost, at a price. And that price comes every seven and a half to eight and a half minutes through these commercials. And I challenge you. I said, go and watch those commercials. I actually study what they're selling you every 32 seconds. Like, does that product benefit your life? Does it make your life better? Is it designed to help you? Or are they just selling you another version of poison designed to keep you plumb stuck and dumb? Um, you know, just go do it. See what happened. You might, you might surprise me. You might find something on there. Be like, you know what, Brandon? I saw this one commercial and it changed my life forever and probably ain't gonna come during a football game. And then, and then what's interesting, when you look up the biggest advertisers, let's just, let's just let the Internet tell us who it is. There you go. Gatorade, visa, Campbell, FedEx, Frito lay, Pepsi cast, or motor oil. Verizon and USAA. They do a lot. And I believe the army is one of the top NFL spenders. That's interesting. They don't have them on here because they certainly are. I think every time the army flies one of those planes over for the national anthem, like, they're paying the NFL to be able to do that every time they take an american flag and run it down the field and wave it up and down like, they pay for that opportunity. You know, it's just interesting that now all of a sudden, they're not listed on here. But nonetheless, I think it goes, you know, just to show, like, companies are making money from the future destruction and derived contrived plan for civilization. So it's like at some point you have to agree not to participate in the biggest charade of all time, which is currently known as global politics, right? A lot of people are choosing just to opt out. Like, I saw this one instagram video, you know, and it said, neither. You know what I'm saying? Like, who do you want? Do you want the egotistical billionaire or do you want the bought and paid for lifetime politician? Well, yeah, I. I'm gonna vote bitcoin for president. Like, if. If I. If I actually registered and went down to the voting office and did the whole nine, like, I would definitely write in bitcoin or Satoshi Nakamoto. And it'd be interesting to see, like, I guarantee you there's people doing it. Like, I thought about doing it back in, like, 2012. So it's interesting to see. I guarantee you people are gonna do that. But we've been. We've been duped. Like, this is the false bill of goods, you know? It's like we're literally watching the machine continue to profit off the plunder of civilization. And at some point, you have to, you know, opt out, you know, and that's what. That's what a lot of people are doing. Pepsico, there you go. Because they're. They're selling health by the droves. It's holistic, it's vegan. It's all of the great things you want to feed your children. It's Pepsi. So there you go. That's who the NFL has as its biggest advertisers. This is how tensions in the Middle east can adversely or consequently supplement the ongoing price of bitcoin. And this is how we're literally just watching pennies on the dollar being converted in crypto right now. Bitcoin is at about $61,000. Had a little bit of a pullback. I'm going to do an in depth chart on it for tomorrow's video for the free bitcoin giveaway on Friday. But I just saw this. Tensions in the Middle east, and I know it's only going in one direction. Like, all. All lines point to one inevitability, and that is global conflict. So on the other side of that, we're going to have to start to rethink our priorities and ultimately start to predicate a future that's in the benefit of society and not to his detriment. So, with that being said, everybody is that time of the day. Signing out boss boy BK, no matter where you stay. Brazil. Debate California all the way back out through Ger-Money. Good night, good morning and good day. Thank you for joining me. Thank you for your time. Hit that thumbs up button for a player one time. Do that for me if you appreciate mine. Till we meet again. Stay cryptic, y'all. Peace. Like a boss, huh? Huh?"
}